In [1]:
import pandas as pd

print("EXERCISE 1: Data Cleaning Challenge")

print("Using your BMW dataset, try to:")

print("1. Find how many missing values are in each column")

print("2. Remove all rows with missing prices") 

print("3. Fill missing years with the most common year")

print("4. Find and remove duplicate entries")

print("5. Calculate average price after cleaning")

print("\nTry both Python and Pandas approaches!")

In [4]:
df = pd.read_csv('bmw_with_missing_data.csv')
df.head()

      model  year  price transmission mileage fuelType  tax   mpg engineSize
0  5 Series  2014  11200    Automatic   67068   Diesel  NaN  57.6        2.0
1  6 Series   NaN  27000    Automatic   14827   Petrol  145  42.8        2.0
2  5 Series  2016  16000          NaN   62794   Diesel  160  51.4        3.0
3  1 Series  2017  12750    Automatic   26676   Diesel  NaN  72.4        1.5
4  7 Series  2014    NaN    Automatic   39554   Diesel  160  50.4        3.0

#### print("1. Find how many missing values are in each column")

In [5]:
print(df.isnull().sum())

model            9
year            20
price           17
transmission    14
mileage         16
fuelType        14
tax              7
mpg             14
engineSize       5
dtype: int64

#### print("2. Remove all rows with missing prices")

In [9]:
df1 = df.dropna(subset=['price'])
print(df1.isnull().sum())

model            9
year            20
price            0
transmission    14
mileage         15
fuelType        14
tax              7
mpg             12
engineSize       5
dtype: int64

#### print("3. Fill missing years with the most common year")

In [10]:
most_common_year = df['year'].mode()[0]
df['year'].fillna(most_common_year, inplace = True)

C:\Users\vaish\AppData\Local\Temp\ipykernel_2872\524717831.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['year'].fillna(most_common_year, inplace = True)

#### print("4. Find and remove duplicate entries")

In [18]:
df2 = df.drop_duplicates()

#### print("5. Calculate average price after cleaning")

In [22]:
print(df['price'].dtype)

object

In [25]:
df['price'] = pd.to_numeric(df['price'],errors = 'coerce')

In [26]:
df = df.dropna(subset=['price'])

In [27]:
average_price = df['price'].mean()
print(f"Average Price: {round(average_price,2)}")

Average Price: 15602.62

#### print("\nTry both Python and Pandas approaches!")